driver-tests/iepse/IEPBatchedStreamOutput/BatchedStreamOutputIep/src/NotificationStreamInput/NotificationStreamInput.wsdl

<definitions targetNamespace="NotificationStreamInput.NotificationStreamInput_iep"
             xmlns:tns="NotificationStreamInput.NotificationStreamInput_iep"
             xmlns:typens="NotificationStreamInput.NotificationStreamInput_iep"
             xmlns:defns="NotificationStreamInput.NotificationStreamInput_iep"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
             xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/"
             xmlns="http://schemas.xmlsoap.org/wsdl/">
<types>
    <xsd:schema targetNamespace="NotificationStreamInput.NotificationStreamInput_iep" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <xsd:element name="StreamInput0_MsgObj">
            <xsd:complexType>
                <xsd:sequence>
                    <xsd:element name="id" type="xsd:int"/>
                    <xsd:element name="name" type="xsd:string"/>
                    <xsd:element name="price" type="xsd:double"/>
                    <xsd:element name="parentID" type="xsd:long"/>
                    <xsd:element name="data" type="xsd:anyType"/>
                    <xsd:element name="orderTimeStamp" type="xsd:dateTime"/>
                    <xsd:element name="orderDate" type="xsd:date"/>
                </xsd:sequence>
            </xsd:complexType>
        </xsd:element>
        <xsd:element name="StreamInput0Batch_MsgObj">
            <xsd:complexType>
                <xsd:sequence>
                    <xsd:element name="StreamInput0_MsgObj" minOccurs="0" maxOccurs="unbounded">
                        <xsd:complexType>
                            <xsd:sequence>
                    <xsd:element name="id" type="xsd:int"/>
                    <xsd:element name="name" type="xsd:string"/>
                    <xsd:element name="price" type="xsd:double"/>
                    <xsd:element name="parentID" type="xsd:long"/>
                    <xsd:element name="data" type="xsd:anyType"/>
                    <xsd:element name="orderTimeStamp" type="xsd:dateTime"/>
                    <xsd:element name="orderDate" type="xsd:date"/>
                            </xsd:sequence>
                        </xsd:complexType>
                    </xsd:element>
                </xsd:sequence>
            </xsd:complexType>
        </xsd:element>
        <xsd:element name="BatchedStreamOutput0Batch_MsgObj">
            <xsd:complexType>
                <xsd:sequence>
                    <xsd:element name="BatchedStreamOutput0_MsgObj" minOccurs="0" maxOccurs="unbounded">
                        <xsd:complexType>
                            <xsd:sequence>
                               <xsd:element name="id" type="xsd:int"/>
                               <xsd:element name="name" type="xsd:string"/>
                               <xsd:element name="price" type="xsd:double"/>
                               <xsd:element name="parentID" type="xsd:long"/>
                               <xsd:element name="orderTimeStamp" type="xsd:dateTime"/>
                               <xsd:element name="orderDate" type="xsd:date"/>
                                       </xsd:sequence>
                        </xsd:complexType>
                    </xsd:element>
                </xsd:sequence>
            </xsd:complexType>
        </xsd:element>
    </xsd:schema>
</types>

<message name="StreamInput0_Msg">
    <part name="input" element="typens:StreamInput0_MsgObj"/>
</message>
<message name="StreamInput0Batch_Msg">
    <part name="input" element="typens:StreamInput0Batch_MsgObj"/>
</message>
<message name="BatchedStreamOutput0Batch_Msg">
    <part name="output" element="typens:BatchedStreamOutput0Batch_MsgObj"/>
</message>

<portType name="InputPt">
    <operation name="StreamInput0">
        <input message="tns:StreamInput0_Msg"/>
    </operation>
    <operation name="StreamInput0Batch">
        <input message="tns:StreamInput0Batch_Msg"/>
    </operation>
</portType>
<portType name="OutputPt_BatchedStreamOutput0">
    <operation name="BatchedStreamOutput0">
        <input message="tns:BatchedStreamOutput0Batch_Msg"/>
    </operation>
</portType>

<plnk:partnerLinkType name="InputPlt" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <plnk:role name = "InputRn" portType="tns:InputPt"/>
</plnk:partnerLinkType>
<plnk:partnerLinkType name="OutputPlt_BatchedStreamOutput0" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <plnk:role name = "OutputRn_BatchedStreamOutput0" portType="tns:OutputPt_BatchedStreamOutput0"/>
</plnk:partnerLinkType>
<!-- input binding -->
<binding name="InputBinding" type="defns:InputPt">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="StreamInput0">
        <soap:operation soapAction="StreamInput0"/>
        <input>
            <soap:body use="literal"/>
        </input>
    </operation>
    <operation name="StreamInput0Batch">
        <soap:operation soapAction="StreamInput0Batch"/>
        <input>
            <soap:body use="literal"/>
        </input>
    </operation>
</binding>
<!-- input service -->
<service name="InputService">
    <port name="InputPort" binding="tns:InputBinding">
        <soap:address location="http://localhost:${HttpDefaultPort}/service/NotificationStreamInput.NotificationStreamInput_iep"/>
    </port>
</service>

<!-- http output binding and service
<binding name="OutputBinding_BatchedStreamOutput0" type="defns:OutputPt_BatchedStreamOutput0">
    <operation name="BatchedStreamOutput0">
        <soap:operation soapAction="BatchedStreamOutput0"/>
        <input>
            <soap:body use="literal"/>
        </input>
    </operation>
</binding>
<service name="OutputService_BatchedStreamOutput0">
    <port name="OutputPort_BatchedStreamOutput0" binding="tns:OutputBinding_BatchedStreamOutput0">
        <soap:address location="http://localhost:${HttpDefaultPort}/service/NotificationStreamInput.NotificationStreamInput_iep_BatchedStreamOutput0_callee"/>
    </port>
</service>
 end of http output binding and service -->

<!-- file output binding and service -->
<binding name="OutputBinding_BatchedStreamOutput0" type="defns:OutputPt_BatchedStreamOutput0">
    <file:binding/>
    <operation name="BatchedStreamOutput0">
        <file:operation/>
        <input>
            <file:message fileName="actual.txt"
                    fileNameIsPattern="false"
                    addEOL="false"
                    multipleRecordsPerFile="true"
                    use="literal"/>
        </input>
    </operation>
</binding>
<service name="OutputService_BatchedStreamOutput0">
    <port name="OutputPort_BatchedStreamOutput0" binding="tns:OutputBinding_BatchedStreamOutput0">
        <file:address fileDirectory="${ojc-root}/driver-tests/iepse/IEPBatchedStreamOutput/BatchedStreamOutputApp/test/NotificationStreamInput"/>
    </port>
</service>
<!-- end of file output binding and service -->
</definitions>
