driver-tests/iepse/IEPContiguousOrder/ContiguousOrderApp/test/NotificationStreamInput/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tim="NotificationStreamInput.NotificationStreamInput_iep">
   <soapenv:Header/>
   <soapenv:Body>
      <tim:StreamInput0_MsgObj>
         <a>${a.0}</a>
         <b>${b.0}</b>
         <c>${c.0}</c>
         <d>${d.0}</d>        
         <z>${z.0}</z>                 
      </tim:StreamInput0_MsgObj>
   </soapenv:Body>
</soapenv:Envelope>