driver-tests/iepse/IEPTupleSerialCorrelation/TupleSerialCorrelationApp/test/NotificationStreamInput/template.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:del="NotificationStreamInput.NotificationStreamInput_iep">
  <soapenv:Body>
    <del:StreamInput0_MsgObj>
      <aInt1>${aInt1.0}</aInt1>
      <aBigint1>${aBigint1.0}</aBigint1>
      <double1>${double1.0}</double1>
      <date1>${date1.0}</date1>
      <ts1>${ts1.0}</ts1>
      <varchar1>${varchar1.0}</varchar1>
    </del:StreamInput0_MsgObj>
  </soapenv:Body>
</soapenv:Envelope>